zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
#include "uart_comm.h"
#include "typedef.h"
#include "utils.h"
//#include "aes.h"
#include "stm32f746xx.h"
#include "stm32f7xx_hal.h"

#include "cmsis_os.h"
#include "api_battery.h"
//#include "fatfs.h"
#define UINT unsigned int
//#define AES_CBC_256_DBG
#include "factory_test.h"
#include "apl_factory_test.h"

#define UART_CNT 2
unsigned char cipher[32];

UART_COMM_DES_T uart_comm_des;
JD_OM_MUTEX mutex_channel_select;
jd_om_comm uart_channels[UART_CNT+1];
int active_channel = -1;

static RECV_FILE_DES recv_file_des;
EventGroupHandle_t BatteryResEvents;
RES_BAT_SET_SN_PSW_T br_set_sn;
RES_BAT_GET_INFO_T br_get_info;
RES_BAT_DECODE_T br_decode;
RES_BAT_ENCODE_T br_encode;
RES_BAT_VIRTUAL_PWR_T br_virt_info;
RES_BAT_DISCHARGE_LEVEL_T br_dis_level;
RES_BAT_CHARGE_STATUS_T br_chg_stat;
RES_BAT_PROTOCAL_VERSION_T br_pro_vers;
RES_BAT_PASSWD_CHKSUM_T br_psw_chk;

#define TRHEAD_NAME_ID(name, id) (&os_thread_def_##name_##id)
#define THREAD_DEF(name, id, thread, priority, instances, stacksz)  \
	const osThreadDef_t os_thread_def_##name_##id = \
	{ #name#id, (thread), (priority), (instances), (stacksz)}


void mutex_uart_switch(int slot_num)
{
	if (slot_num != 2 && slot_num != 0)
		return;


	if (active_channel == slot_num)
		return;


	if (slot_num == 2) {
		if (-1 == jd_om_comm_close(&uart_channels[0]))
			printf("close chn 0 err\r\n");
	} else if (0 == slot_num) {
		if (-1 == jd_om_comm_close(&uart_channels[2]))
			printf("close chn 2 err\r\n");
	}

	jd_om_mutex_lock(&(mutex_channel_select));
	active_channel = slot_num;
	jd_om_mutex_unlock(&(mutex_channel_select));
//        return;

	if (slot_num == 2 || slot_num == 0) {

	if (uart_comm_des.thread_uart_recv[0])
		osThreadTerminate(uart_comm_des.thread_uart_recv[0]);

		int ret = 0;
		jd_om_comm_addr local_addr;
		jd_om_comm_addr addr_mask;

		local_addr.addr = tlc_iaddr("1.0.0");
		addr_mask.addr = tlc_iaddr("255.0.0");

		memset(&uart_channels[0], 0, sizeof(jd_om_comm));
		memset(&uart_channels[2], 0, sizeof(jd_om_comm));
		ret = jd_om_comm_open(&uart_channels[slot_num], &local_addr, &addr_mask, 2);
		if (0 != ret) {
			dzlog_error("open uart channel %d fail ret %d.\r\n", slot_num, ret);
			vTaskSuspend(NULL);
		} else {

			if (slot_num == 0)
				memcpy(&uart_channels[2], &uart_channels[0], sizeof(jd_om_comm));
			else
				memcpy(&uart_channels[0], &uart_channels[2], sizeof(jd_om_comm));

		}

		THREAD_DEF(uartRecv, 0, uart_recv_task, osPriorityHigh, 0, 1024);
		uart_comm_des.thread_uart_recv[0] = osThreadCreate(TRHEAD_NAME_ID(uartRecv, 0), &uart_channels[0]);
		if (NULL == uart_comm_des.thread_uart_recv[0]) {
			printf("create Uart recv Task %d failed!.\r\n", 0);
			while (1);
		} else {
			printf("Uart recv task %d create successful !\r\n", 0);
		}

		osDelay(100);
	}

}

int get_uart_channel()
{
	int chn;
	jd_om_mutex_lock(&(mutex_channel_select));
	chn = active_channel;
	jd_om_mutex_unlock(&(mutex_channel_select));
	return chn;
}

CMD_TYPE_T get_cmd_typte(unsigned char type)
{
	if ((type >= 0xC0 &&  type <= 0xDF) || (type >= 0xF0)) {
		return TYPE_REQ;
	}
	else if ((type >= 0xA0 && type <= 0xBF) || (type >= 0xE0 &&  type <= 0xEF)) {
		return TYPE_RES;
	}
	else {
		return TYPE_INVALID;
	}
}
#if 0

static bool is_null_data(unsigned char *buf,int buf_size)
{
	bool is_null = true;
	int i=0;

	for(i=0;i<buf_size;i++){
		if((buf[i]&0xFF) != 0){
			is_null = false;
			break;
		}
	}
	return is_null;
}
#endif
void print_hex(char *func,char *data, int len)
{
#if 1
	int i;
	char hex[128] = { 0 };
	//dzlog_debug("%s[%d sec]:\r\n", func,RTC->COUNT);
	for (i = 0; i < len; i++) {
		if (0 == i % 16) {
			dzlog_debug("%s\r\n", hex);
			memset(hex, 0, 128);
		}
		sprintf(hex + 3 * (i % 16), "%02x ", data[i]);
	}
	dzlog_debug("%s\r\n", hex);
#endif
}

static unsigned char get_active_res(int ulTimeOut/*millisecond*/)
{
	unsigned int res = 0;
	if(jd_om_task_notify_wait(&res,ulTimeOut) != osOK)	//timeout
		res = 0;
	return (unsigned char)res;
}

static void set_active_res(unsigned char res)
{
	jd_om_task_notify(&(uart_comm_des.thread_handle_send),res);
	//dzlog_debug("set active res as 0x%02x.\r\n", res);
}

unsigned char wait_response(unsigned char ActiveReq)
{
	//unsigned char ret = 1;
	unsigned char res;
	int cnt = WAIT_RESPONSE_TIME_OUT;
	unsigned char req = ActiveReq;

	if (REQ_TRANS_FILE_HEAD == req)
		cnt = WAIT_RESPONSE_TIME_OUT * 5;
	else if (REQ_TRANS_FILE_DATA== req) //mike:need consider not fetch !
		cnt = WAIT_RESPONSE_TIME_OUT * 10;
	else
		cnt = WAIT_RESPONSE_TIME_OUT;

	while (cnt--) {
		res = get_active_res(1);
		if (0 != res) {
			res &= 0xf;
			req &= 0xf;

			if (res == req)
				return 0;
		}
	}

	return 1;
}
#if 0
static FRESULT f_write_decrypted_aes_data(
	jd_om_comm *hdl,
	FIL* fp,			/* Pointer to the file object */
	char *buff,			/* Pointer to the data to be written */
	UINT btw,			/* Number of bytes to write */
	UINT* bw			/* Pointer to number of bytes written */
)
{
	FRESULT error;
    unsigned char iv[AES_BLOCKLEN];        // init vector
    struct AES_ctx ctx;
    unsigned int len;        // encrypt length (in multiple of AES_BLOCK_SIZE)
    unsigned char padding_len = 0;
    int i;

	if(!is_null_data(hdl->cipher,sizeof(hdl->cipher))){
		dzlog_debug("%s:decrypted data\r\n",__func__);

		if((btw%AES_BLOCKLEN) != 0){
			dzlog_error("%s:encrypted data len is not the multiple of AES block ???\r\n",__func__);
			return FR_INVALID_OBJECT;
		}
		for (i=0; i<AES_BLOCKLEN; ++i) {
			iv[i] = 0;
		}
		len = btw;
		AES_init_ctx_iv(&ctx, (uint8_t *)hdl->cipher, iv);
		AES_CBC_decrypt_buffer(&ctx, (uint8_t *)buff, len);
		//print_hex((char *)__func__,buff,len);	//before trim padding
		padding_len = buff[len-1];
		recv_file_des.aes_padding_len += padding_len;
		len -= padding_len;
		//print_hex((char *)__func__,buff,len);	//after trim padding
	#ifdef AES_CBC_256_DBG
		//eject test only
		dzlog_debug("%s:test eject !!!!!!!!!!!!!\r\n",__func__);
		return FR_INVALID_OBJECT;
	#endif
		error = f_write(fp, buff, len, bw);

		if(len != *bw)
			error = FR_INVALID_OBJECT;
	}
	else{
		dzlog_debug("%s:raw data\r\n",__func__);
		error = f_write(fp, buff, btw, bw);
		if(btw != *bw)
			error = FR_INVALID_OBJECT;

