zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
	}
	return error;
}

static void file_move_to_destination(char *file_path,FileType type)
{
	char old_file[MAX_FILE_PATH_SIZE]={0};
	unsigned char old_md5[MD5_SIZE] = { 0 };
	unsigned char new_md5[MD5_SIZE] = { 0 };
	unsigned char file_Dev = SYSDISK;
	unsigned long file_len = 0;
	FRESULT error;

	strncpy(old_file,file_path,strlen(file_path));
	memset(file_path,0,MAX_FILE_PATH_SIZE);
	switch(type){
		case upgrade_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", UPGRADE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case schedule_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", SCHEDULE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case picture_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", PIC_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case voice_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"/%s", strrchr(old_file,'/')+1);
			file_Dev = MP3DISK;
			break;

		default:
			dzlog_error("%s:recv unknown file type %d ???\r\n",__func__,type);
			return;
	}

#ifdef PRIVATE_MP3_FLASH_FS
	if(type == voice_file){
		file_len = get_file_size(SYSDISK,old_file);
		if(PrivateMp3PlayerValidFileSize(file_len)){
			PrivateMp3PlayerSaveFile(old_file);
		}
		else{
			dzlog_error("%s:file size '%d' too large,deny to save !!!\r\n",__func__,file_len);
		}
		ff_unlink(SYSDISK,old_file);
		return;
	}
#endif

	again:
	error = ff_rename(file_Dev,old_file,file_path);
	if(error){
		//fail
		dberr("%s: rename file '%s' to '%s' error=%d\r\n",__func__,old_file,file_path,error);
		if(error == FR_EXIST){	//file exist !
			get_md5(file_Dev,old_md5, old_file, 0);
			get_md5(file_Dev,new_md5, file_path, 0);
			if (0 != memcmp(old_md5, new_md5, MD5_SIZE)) {
				dzlog_error("%s:not the same file,remove '%s',try again...\r\n",__func__,file_path);
				ff_unlink(file_Dev,file_path);
				goto again;
			}
			else{
				dzlog_debug("%s:the same file,ignore rename to '%s'...\r\n",__func__,file_path);
				ff_unlink(file_Dev,old_file);
			}
		}
	}
	else{
		//ok
		dberr("%s: rename file '%s' to '%s' sucessful\r\n",__func__,old_file,file_path);
	}
	return;
}

static osStatus file_transfer_start(jd_om_comm *hdl,char *file_name)
{
	osStatus ret = osOK;
	FRESULT error;
	unsigned char file_Dev = SYSDISK;

	recv_file_des.packet_id = 0;
	recv_file_des.offset = 0;

	snprintf(recv_file_des.file_path,MAX_FILE_PATH_SIZE,"%s/%s", TMP_FILE_DIR,file_name);
	if(recv_file_des.type == upgrade_file){

	}
	else if(recv_file_des.type == schedule_file){

	}
	else if(recv_file_des.type == picture_file){

	}
	else if(recv_file_des.type == voice_file){
		#ifdef PRIVATE_MP3_FLASH_FS
		//save to tmp of sysdisk
		#else
		file_Dev = MP3DISK;
		#endif
	}
	else{
		dzlog_error("recv unknown file type %d\r\n",recv_file_des.type);
		ret = osErrorOS;
		goto RESPONSE;
	}

	if (0 >= recv_file_des.size) {
		dzlog_error("recv slave update file size error\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	error = ff_open(file_Dev,&(recv_file_des.file_handle),_T(recv_file_des.file_path), (FA_WRITE | FA_READ | FA_CREATE_ALWAYS));
	if (error) {
        if (error == FR_EXIST)
        {
            dzlog_error("File exists.\r\n");
        }
        else
        {
            dzlog_error("Open file failed.\r\n");
        }
		dzlog_error("slave create update file fail[file_name=%s,error=%d]\r\n",recv_file_des.file_path,error);
		ret = osErrorOS;
		goto RESPONSE;
	}

	f_lseek(&(recv_file_des.file_handle), 0U);

RESPONSE:
	{
		int payload_size = sizeof(RES_TRANS_FILE_HEAD_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_HEAD;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_HEAD_T res;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		return jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	}
}

static osStatus file_transfer_going(jd_om_comm *hdl,unsigned packet_id, char *data, unsigned len)
{
	osStatus ret = osOK;
	FRESULT error;
	UINT bytesWritten;

	if ((packet_id != recv_file_des.packet_id + 1) &&
	    (!(0 == packet_id && 0 == recv_file_des.packet_id))) {
		dzlog_error("slave update packet id err\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	f_lseek(&(recv_file_des.file_handle), recv_file_des.offset);
	error = f_write_decrypted_aes_data(hdl,&(recv_file_des.file_handle), data, len, &bytesWritten);
	//error = f_write(&(recv_file_des.file_handle), data, len, &bytesWritten);
	if ((error)/* || (len != bytesWritten)*/) {
		dzlog_error("slave update write file err\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

	recv_file_des.packet_id = packet_id;
	recv_file_des.offset += bytesWritten;

	dzlog_debug("file download progress: %d/%d packet_id %d\r\n", recv_file_des.offset, recv_file_des.size, packet_id);

RESPONSE:
	{
		int payload_size = sizeof(RES_TRANS_FILE_DATA_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_DATA;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_DATA_T res;
		res.packet_id = packet_id;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		return jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);
	}
}

static osStatus file_transfer_end(jd_om_comm *hdl)
{
	int restart_sec = 3;
	osStatus ret = osOK;
	unsigned char md5[MD5_SIZE] = { 0 };
	#ifdef PRIVATE_MP3_FLASH_FS
	unsigned char file_Dev = SYSDISK;
	#else
	unsigned char file_Dev = (recv_file_des.type == voice_file)?MP3DISK:SYSDISK;
	#endif

	dzlog_debug("slave update end\r\n");
	f_sync(&(recv_file_des.file_handle));
	f_close(&(recv_file_des.file_handle));
	get_md5(file_Dev,md5, recv_file_des.file_path, 0);

	dzlog_debug("%s:[file_size=%d,padding_len=%d]\r\n",__func__,
		recv_file_des.size,recv_file_des.aes_padding_len);
	if ((recv_file_des.size-recv_file_des.aes_padding_len) != get_file_size(file_Dev,recv_file_des.file_path)) {
		dzlog_error("slave update file size wrong\r\n");
		ret = osErrorOS;
		goto RESPONSE;
	}

