zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
	if (0 != memcmp(md5, recv_file_des.md5, MD5_SIZE)) {
		dzlog_error("slave update file md5 wrong\r\n");
		ret = osErrorOS;
	}

	if(ret == osOK)
		file_move_to_destination(recv_file_des.file_path,(FileType)(recv_file_des.type));

	if((ret == osOK)/* && (recv_file_des.type == schedule_file)*/){
		//notify a file transfering completed!
		jd_master_com_send_play_msg(hdl,REQ_TRANS_FILE_END,NULL);
	}

RESPONSE:
	{
		dzlog_debug("slave end\r\n");
		int payload_size = sizeof(RES_TRANS_FILE_END_T);
		int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
		MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

		pkt->head.start = START_CMD;
		pkt->head.slave = SLAVE_1;
		pkt->head.type = RES_TRANS_FILE_END;
		pkt->head.payload_len = payload_size;

		RES_TRANS_FILE_END_T res;
		res.code = ret;
		memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), &res, payload_size);

		unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
		memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

		ret = jd_om_mq_send(&(hdl->uart_comm_des.send_queue), (void *)pkt);

		if ((0 == res.code) && (recv_file_des.type == upgrade_file)) {
			dzlog_debug("%s:recv upgrade file completed !\r\n",__func__);
			jd_om_msleep(1000);	//wait host get the response.
			//TODO:set a new bin flag to eeprom to notify boot entry upgrade mode here!
			if(copy_upgrade_file_to_flash(recv_file_des.file_path) != osOK){
				debug("upgrade err\n");
			}
			else{
				set_upgrade_flag();
				dbinfo("upgrade suc\r\n");
				dbinfo("System will reboot in 3s\r\n");
				do{
					dbinfo("%d...\r\n", restart_sec);
					restart_sec--;
					jd_om_msleep(1000);
				}while(restart_sec > 0);
				dbinfo("\r\n===>>>reboot now\r\n");
				__disable_irq();
				__set_PSP(0x20018000);
				EMC_Deinit(EMC);
				ispPinInit();
				system_reset();
			}
		}

		if(res.code != osOK){
			dzlog_error("#####%s:start to delete bad file '%s'#####\r\n",__func__,recv_file_des.file_path);
			ff_unlink(file_Dev,recv_file_des.file_path);
		}
		memset(recv_file_des.version,0,4);
		memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);
		recv_file_des.type = 0;
		recv_file_des.size = 0;
		recv_file_des.packet_id = 0;
		recv_file_des.offset = 0;
		recv_file_des.size = 0;
		recv_file_des.aes_padding_len = 0;
		memset(recv_file_des.md5, 0, MD5_SIZE);

		return ret;
	}
}

static osStatus jd_master_com_send_play_msg(jd_om_comm *hdl,unsigned char type, void *req_data)
{
	pic_play_msg *msg = NULL;

	switch (type){

		case REQ_TRANS_FILE_HEAD:
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_start;

			msg->msg.info_file.type = ((REQ_TRANS_FILE_HEAD_T *)req_data)->type;

			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			memcpy(msg->msg.info_file.file_name,((REQ_TRANS_FILE_HEAD_T *)req_data)->file_name,64);
			memcpy(msg->msg.info_file.md5,((REQ_TRANS_FILE_HEAD_T *)req_data)->md5,MD5_SIZE);
			break;

		case REQ_TRANS_FILE_END:	//file transfering completed!
			msg = jd_om_malloc(sizeof(pic_play_msg));
			msg->type = pic_play_file_update_end;
			msg->msg.info_file.type = recv_file_des.type;
			memset(msg->msg.info_file.file_name,0,sizeof(msg->msg.info_file.file_name));
			snprintf(msg->msg.info_file.file_name,64,"%s",strrchr(recv_file_des.file_path,'/')+1);
			break;

		default:
			dzlog_error("%s:unknown type=%d.\r\n",__func__,type);
			break;
	}

	if(msg){
		jd_om_mq_send(&(hdl->uart_comm_des.play_queue), msg);
		//wait play task to set responsed
		jd_om_sem_wait(&(hdl->uart_comm_des.sem),0);
		return osOK;
	}
	return osErrorOS;
}
#endif

#if 0
static osStatus jd_master_com_send_exception_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	osStatus ret;

	res_type = (type&0x0F)|0xA0;
	payload_size = sizeof(RES_COMMON_T);

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}
#endif
int uart_sent_dumb()
{
	int ret = -1;
	int payload_len = 512;
	int pkt_len = sizeof(MSG_UART_HEAD_T) + payload_len + CHECKSUM_SIZE;
	static u32 packetid = 0;
	unsigned char *pt = jd_om_malloc(pkt_len);

	MSG_UART_HEAD_T *head = (MSG_UART_HEAD_T *)pt;

	head->start = START_CMD;
	head->type = RES_GET_TIME;
	head->payload_len = payload_len;
	head->packet_id = packetid++;

	memset(pt + sizeof(MSG_UART_HEAD_T), 0xde, payload_len);

	unsigned short checksum = crc16((char *)pt, pkt_len - CHECKSUM_SIZE);
	memcpy((char *)pt + pkt_len - CHECKSUM_SIZE, &checksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pt);
	if (ret) {
		dzlog_error("%s send msg error\n", __func__);
		jd_om_free(pt);
	}

	return 0;
}

u8 get_packet_id()
{
	static unsigned char uart_packet_id = 0;
	return uart_packet_id++;
}


int wait_battery_response(EventBits_t bat_evt, TickType_t timeout)
{
	EventBits_t bits;
	xEventGroupClearBits(BatteryResEvents, bat_evt);
	bits = xEventGroupWaitBits(BatteryResEvents, bat_evt, (BaseType_t)pdTRUE, (BaseType_t)pdTRUE, timeout);
	if (bits & bat_evt) {
		return 0;
	} else {
		dzlog_debug("######## wait event %d err %d\r\n", bat_evt, bits);
		return -1;
	}
}


#define SECONDS_IN_A_DAY (86400U)
#define SECONDS_IN_A_HOUR (3600U)
#define SECONDS_IN_A_MINUTE (60U)
#define DAYS_IN_A_YEAR (365U)
#define YEAR_RANGE_START (1970U)
#define YEAR_RANGE_END (2099U)
#if 0
static void RTC_ConvertSecondsToDatetime(uint32_t seconds, rtc_datetime_t *datetime)
{
    assert(datetime);

    uint32_t x;
    uint32_t secondsRemaining, days;
    uint16_t daysInYear;
    /* Table of days in a month for a non leap year. First entry in the table is not used,
     * valid months start from 1
     */
    uint8_t daysPerMonth[] = {0U, 31U, 28U, 31U, 30U, 31U, 30U, 31U, 31U, 30U, 31U, 30U, 31U};

    /* Start with the seconds value that is passed in to be converted to date time format */
    secondsRemaining = seconds;

    /* Calcuate the number of days, we add 1 for the current day which is represented in the
     * hours and seconds field
     */
    days = secondsRemaining / SECONDS_IN_A_DAY + 1;

