zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
    /* Update seconds left*/
    secondsRemaining = secondsRemaining % SECONDS_IN_A_DAY;

    /* Calculate the datetime hour, minute and second fields */
    datetime->hour = secondsRemaining / SECONDS_IN_A_HOUR;
    secondsRemaining = secondsRemaining % SECONDS_IN_A_HOUR;
    datetime->minute = secondsRemaining / 60U;
    datetime->second = secondsRemaining % SECONDS_IN_A_MINUTE;

    /* Calculate year */
    daysInYear = DAYS_IN_A_YEAR;
    datetime->year = YEAR_RANGE_START;
    while (days > daysInYear)
    {
        /* Decrease day count by a year and increment year by 1 */
        days -= daysInYear;
        datetime->year++;

        /* Adjust the number of days for a leap year */
        if (datetime->year & 3U)
        {
            daysInYear = DAYS_IN_A_YEAR;
        }
        else
        {
            daysInYear = DAYS_IN_A_YEAR + 1;
        }
    }

    /* Adjust the days in February for a leap year */
    if (!(datetime->year & 3U))
    {
        daysPerMonth[2] = 29U;
    }

    for (x = 1U; x <= 12U; x++)
    {
        if (days <= daysPerMonth[x])
        {
            datetime->month = x;
            break;
        }
        else
        {
            days -= daysPerMonth[x];
        }
    }

    datetime->day = days;
}

static void jd_master_com_set_system_time(uint32_t timeSeconds)
{
	rtc_datetime_t date;
	uint32_t seconds = 0;

	seconds = timeSeconds + (60*60*8);	//transfer UTC to BeiJing Time.
	RTC_ConvertSecondsToDatetime(seconds, &date);

    /* RTC time counter has to be stopped before setting the date & time in the TSR register */
    RTC_StopTimer(RTC);

    /* Set RTC time to default */
    RTC_SetDatetime(RTC, &date);

    /* Enable at the NVIC */
    EnableIRQ(RTC_IRQn);

    /* Start the RTC time counter */
    RTC_StartTimer(RTC);
}

static uint32_t jd_master_com_get_system_time_second(void)
{
	uint32_t currSeconds = 0;

	//transfer current seconds to UTC time.
	currSeconds = RTC->COUNT - (60*60*8);	//transfer BeiJing Time to UTC.
	return currSeconds;
}

static void jd_master_com_clear_communication_cipher(void)
{
	uint32_t eeprom_data = 0x00000000U;
	int i=0;

	dzlog_debug("%s:clear Cipher sucessful\r\n",__func__);
	//clear cipher
	for(i=0;i<8;i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER+(i*4),eeprom_data);
	}
	//clear flag.
	EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER_FLAG,eeprom_data);
}

static unsigned char jd_master_com_set_communication_cipher(unsigned char len,char *cipher)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	if(AES_KEYLEN != len){
		dzlog_error("%s:wrong key len[desired len %d but get len %d]!!!!!\r\n",
			__func__,AES_KEYLEN,len);
		ret = 1;
		return ret;
	}

	for(i=0;i<(len/4);i++){
		dzlog_debug("%s:Write EEPROM...%d Value = 0x%02X 0x%02X 0x%02X 0x%02X\r\n",__func__,
			i,cipher[i*4],cipher[i*4+1],cipher[i*4+2],cipher[i*4+3]);
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER+(i*4),
			(cipher[i*4]<<24)|(cipher[i*4+1]<<16)|(cipher[i*4+2]<<8)|cipher[i*4+3]);
	}
	//read out the cipher
	for(i=0;i<(len/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER +(i*4)));
		if(eeprom_data != ((cipher[i*4]<<24)|(cipher[i*4+1]<<16)|(cipher[i*4+2]<<8)|cipher[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,cipher[i*4],cipher[i*4+1],cipher[i*4+2],cipher[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write cipher ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_CIPHER_FLAG,EEPROM_CIPGER_FLAG_VALID);
		dzlog_debug("%s:Write Cipher to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

static bool jd_master_com_get_communication_cipher(unsigned char len,unsigned char *cipher)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	bool cipherSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER_FLAG));
	if(eeprom_data == EEPROM_CIPGER_FLAG_VALID){
		for(i=0;i<(len/4);i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_CIPHER+(i*4)));
			cipher[i*4] = (eeprom_data>>24)&0xFF;
			cipher[i*4+1] = (eeprom_data>>16)&0xFF;
			cipher[i*4+2] = (eeprom_data>>8)&0xFF;
			cipher[i*4+3] = eeprom_data&0xFF;
		}
		cipherSet = true;
	}
	return cipherSet;
}

static unsigned char jd_master_com_set_dev_sn(unsigned char *sn)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	unsigned char tmp_sn[12];
	int i=0;
	unsigned char ret = 0;	//default 0:ok.

	memset(tmp_sn,0,sizeof(tmp_sn));
	memcpy(tmp_sn,sn,10);
	for(i=0;i<10;i++){
		dzlog_debug("%s:Write EEPROM...%d Value = 0x%02X\r\n",__func__,i,tmp_sn[i]);
	}

	//write the sn into eeprom
	for(i=0;i<3;i++){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_SN+(i*4),
			(tmp_sn[i*4]<<24)|(tmp_sn[i*4+1]<<16)|(tmp_sn[i*4+2]<<8)|tmp_sn[i*4+3]);
	}

	//read out the sn from eeprom
	for(i=0;i<3;i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN +(i*4)));
		if(eeprom_data != ((tmp_sn[i*4]<<24)|(tmp_sn[i*4+1]<<16)|(tmp_sn[i*4+2]<<8)|tmp_sn[i*4+3])){
			dzlog_error("%s:Read EEPROM error...%d eeprom_Value = 0x%X,origin_Value = %02x %02x %02x %02x\r\n",
				__func__,i,eeprom_data,tmp_sn[i*4],tmp_sn[i*4+1],tmp_sn[i*4+2],tmp_sn[i*4+3]);
			ret = 1;
			break;
		}
	}
	//set the valid flag if write sn ok.
	if(ret==0){
		EEPROM_WriteWord(EXAMPLE_EEPROM, EEPROM_ADDR_SN_FLAG,EEPROM_SN_VALID_FLAG);
		dzlog_debug("%s:Write SN to EEPROM sucessful\r\n",__func__);
	}
	return ret;
}

bool jd_master_com_get_dev_sn(unsigned char *sn)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;
	unsigned char tmp_sn[12];
	bool snSet = false;

	eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN_FLAG));
	if(eeprom_data == EEPROM_SN_VALID_FLAG){
		for(i=0;i<3;i++){
			eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + EEPROM_ADDR_SN +(i*4)));
			tmp_sn[i*4] = (eeprom_data>>24)&0xFF;
			tmp_sn[i*4+1] = (eeprom_data>>16)&0xFF;
			tmp_sn[i*4+2] = (eeprom_data>>8)&0xFF;
			tmp_sn[i*4+3] = eeprom_data&0xFF;
		}
		if(sn != NULL)
			memcpy(sn,tmp_sn,10);
		snSet = true;
	}

