zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
	//	判断start字段值是否正�?
	if (START_CMD != start) {
		dzlog_error("recv invalid packet\r\n");
		goto FREE;
	}

	// 获取type字段
	type = head->type;
	//dzlog_debug("recv type %02x\r\n", type);

	//判断start字段值是否正�?
	switch(get_cmd_typte(type)) {
		case TYPE_INVALID:
			goto FREE;
		case TYPE_RES:
			set_active_res(type);
			if(head->packet_id == last_session_id_res){
				dzlog_error("recv repeat packet\r\n");
				goto FREE;
			} else{
				last_session_id_res = head->packet_id;
			}
			break;
		case TYPE_REQ:
			if(head->packet_id == last_session_id_req){
				dzlog_error("recv repeat packet\r\n");
				goto FREE;
			} else{
				last_session_id_req = head->packet_id;
			}
			break;
		default:
			break;
	}

	// 获取payload_len字段
	payload_len = head->payload_len;

	// 校验payload_len合法
	if (payload_len >= MAX_QUEUE_ELEMENT_SIZE) {
		dzlog_error("recv invalid payload_len:%d\r\n",payload_len);
		goto FREE;
	}

	// 获取payload
	memset(payload, 0, MAX_QUEUE_ELEMENT_SIZE);
	memcpy(payload, pt + sizeof(MSG_UART_HEAD_T), payload_len);


	//获取checksum
	unsigned short chksum;
	memcpy(&chksum, pt + sizeof(MSG_UART_HEAD_T) + payload_len, sizeof(chksum));
	if (chksum != crc16(pt, sizeof(MSG_UART_HEAD_T) + payload_len)) {
		dzlog_error("checksum wrong\r\n");
		goto FREE;
	}

	switch (type) {
	case REQ_DEVICE_INFO:
	case REQ_SET_SN:
	case REQ_GET_TIME:
	case REQ_SET_TIME:
	case REQ_FLASH_LED:
	case REQ_SLOT_LED:
	case REQ_SLOT_ELOCK:
	case REQ_SLOT_POWER:
	case REQ_SLOT_KEY_STAT:
	case REQ_BATTERY_ENCRYPT:
	case REQ_BATTERY_INFO:
	case REQ_GPRS_MODULE_INFO:
	case REQ_GPRS_CONNECT:
	case REQ_DEVICE_AGEING:
	case REQ_ENV_TEMPRATURE:
		{
			add_factory_test_item(pt);
			return 0;

		}

		case RES_BAT_SET_SN_PSW:
		{
			RES_BAT_SET_SN_PSW_T *res = (RES_BAT_SET_SN_PSW_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++set battery sn res %d\r\n", res->code);
			memcpy(&br_set_sn, res, sizeof(RES_BAT_SET_SN_PSW_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_SET_SN);
			break;
		}
		case RES_BAT_GET_INFO:
		{
			RES_BAT_GET_INFO_T *res = (RES_BAT_GET_INFO_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++get battery info sn len %d sn %s temp %d vol_h %d vol_l %d ratio %d\r\n",
				res->sn_len,		//sn 有效长度
				res->sn,		//sn
				res->Temp,			//温度: 16进制温度值（单位：摄氏度�?偏移�?40(避免负温�?
				res->Vol_H,		//电压：高�?
				res->Vol_L,		//电压：低�?
				res->ratio);		//16进制
			memcpy(&br_get_info, res, sizeof(RES_BAT_GET_INFO_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_GET_INFO);
			break;
		}
		case RES_BAT_ENCODE:
		{
			RES_BAT_ENCODE_T *res = (RES_BAT_ENCODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery encode res %d\r\n", res->code);
			memcpy(&br_encode, res, sizeof(RES_BAT_ENCODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_ENCODE);
			break;
		}
		case RES_BAT_DECODE:
		{
			RES_BAT_DECODE_T *res = (RES_BAT_DECODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery decode res %d \r\n", res->code);
			memcpy(&br_decode, res, sizeof(RES_BAT_DECODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_DECODE);
			break;
		}
		case RES_BAT_VIRTUAL_PWR_INFO:
		{

			RES_BAT_VIRTUAL_PWR_T *res = (RES_BAT_VIRTUAL_PWR_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery virtual info cnt1 %d cnt2 %d ratio %d last %d discharging %d \r\n",
				res->data[0], res->data[1], res->data[2], res->data[3], res->data[4]);

			memcpy(&br_virt_info, res, sizeof(RES_BAT_VIRTUAL_PWR_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_VIRT_PWR_INFO);
			break;
		}
		case RES_BAT_DISCHARGE_LEVEL:
		{
			RES_BAT_DISCHARGE_LEVEL_T *res = (RES_BAT_DISCHARGE_LEVEL_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery discharge level res %d\r\n", res->code);
			memcpy(&br_dis_level, res, sizeof(RES_BAT_DISCHARGE_LEVEL_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_DISCHG_LEVEL);
			break;
		}
		case RES_BAT_CHARGE_STATUS:
		{
			RES_BAT_CHARGE_STATUS_T *res = (RES_BAT_CHARGE_STATUS_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery charge status level %d status %d\r\n", res->data[0], res->data[1]);
			memcpy(&br_chg_stat, res, sizeof(RES_BAT_CHARGE_STATUS_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_CHARGE_STAT);
			break;
		}
		case RES_BAT_PROTOCAL_VERSION:
		{
			RES_BAT_PROTOCAL_VERSION_T *res = (RES_BAT_PROTOCAL_VERSION_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery protocal version len %d version %d.%d.%d\r\n",
				res->ver_len, res->ver[0], res->ver[1], res->ver[2]);
			memcpy(&br_pro_vers, res, sizeof(RES_BAT_PROTOCAL_VERSION_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_PROT_VERS);
			break;
		}
		case RES_BAT_PASSWD_CHKSUM:
		{
			RES_BAT_PASSWD_CHKSUM_T *res = (RES_BAT_PASSWD_CHKSUM_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery crc 0x%02x 0x%02x\r\n", res->crc[0], res->crc[1]);
			memcpy(&br_psw_chk, res, sizeof(RES_BAT_PASSWD_CHKSUM_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_PSW_CHKSUM);
			break;
		}

		default:
			break;
	}

FREE:
	jd_om_free(pt);
	return 0;
}

#if 0

		//recevicing file here.
		case REQ_TRANS_FILE_HEAD:
		{
			REQ_TRANS_FILE_HEAD_T *req = (REQ_TRANS_FILE_HEAD_T *)(pt + sizeof(MSG_UART_HEAD_T));
			if(strlen(recv_file_des.file_path)>0){
				dzlog_error("###############last transfer file '%s' not closed#############\r\n",
					recv_file_des.file_path);
				f_sync(&(recv_file_des.file_handle));
				f_close(&(recv_file_des.file_handle));
			}
			memset(recv_file_des.version,0,4);
			memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);
			memset(recv_file_des.md5, 0, MD5_SIZE);
			memcpy(recv_file_des.md5, req->md5, MD5_SIZE);
			recv_file_des.size = req->size;
			recv_file_des.type = req->type;
			recv_file_des.aes_padding_len = 0;	//init aes padding length.
			old_pkt_id = 1;
			if((recv_file_des.type == voice_file) && (!ends_with(req->file_name,".mp3"))){
				dzlog_error("voice type mismatch with file name '%s'###\r\n",req->file_name);
			}
			else{
				jd_master_com_send_play_msg(hdl,type,(void *)req);
				file_transfer_start(hdl,req->file_name);
				*trans_timeout_cnt = 0;
				*file_trans = true;
				has_send_res = true;
			}
			break;
		}

